# Pandas
## um dos pacotes mais importantes do Data Science Toolbox  
## usa dois tipos diferentes de estruturas de dados
* Series - dado na forma 1D  - array unidimensional com labels
* Dataframes - dado na forma de tabela 2D  - mais usado que o anterior
Quando temos os dados em dataframes, podemos realizar muitas análises

# Dicionários  
Todos os tipos de dados compostos que estudamos em detalhes até agora — strings, listas e tuplas — são coleções sequenciais. Isto significa que os itens na coleção estão ordenados da esquerda para a direita e eles usam números inteiros como índices para acessar os valores que eles contêm.  

Dicionário é um tipo diferente de coleção. Ele é um tipo de mapeamento nativo do Python. Um mapa é uma coleção associativa desordenada. A associação, ou mapeamento, é feita a partir de uma chave, que pode ser qualquer tipo imutável, para um valor, que pode ser qualquer objeto de dados do Python.  
  
Como exemplo, vamos criar um dicionário para traduzir palavras em inglês para Espanhol. Para este dicionário, as chaves são strings.

Uma maneira de criar um dicionário é começar com o dicionário vazio e adicionar pares chave-valor. O dicionário vazio é denotado {}

In [2]:
import pandas as pd

In [3]:
dict={'a':3,'b':'cat','c':2.5}
#index and value nesta ordem
pd.Series(dict)

a      3
b    cat
c    2.5
dtype: object

In [4]:
oneD=pd.Series([3,'cat',2.5],['a','b','c'])
oneD

a      3
b    cat
c    2.5
dtype: object

In [8]:
twoD=pd.Series([100,'cat',310,'gog',500],['Amy', 'Bob','Cat','Don','Emma'])
twoD

Amy     100
Bob     cat
Cat     310
Don     gog
Emma    500
dtype: object

In [9]:
twoD=pd.Series([100,'cat',310,'gog',500],index=['Amy', 'Bob','Cat','Don','Emma'])
twoD

Amy     100
Bob     cat
Cat     310
Don     gog
Emma    500
dtype: object

In [12]:
twoD.loc[['Cat','Emma']] #loc is a label-location based indexer for selection by labels
#é um localizar no dicionário os valores desses indexes

Cat     310
Emma    500
dtype: object

In [13]:
#we can extract the data at index 0, 3 and 4
twoD[[0,3,4]]

Amy     100
Don     gog
Emma    500
dtype: object

In [16]:
#iloc é a posição do value
twoD.iloc[3]

'gog'

In [18]:
#check if there is an element in the series index
print('cat' in twoD)
print('Cat' in twoD)
print('Emma' in twoD)

False
True
True

In [21]:
twoD[:]

Amy     100
Bob     cat
Cat     310
Don     gog
Emma    500
dtype: object

## Dataframes  
Most important pandas datastructure (2D). Stores data in tabular form (rows and columns)  
class 'pandas.core.frame.DataFrame'  
We will learn how to create pandas dataframe from scratch  
in variable d we create a dict :

In [23]:
d={'A':pd.Series([100,200,300],index=['apple','pear','orange']),
  'B': pd.Series([111,222,333,4444],index=['apple','pear','orange', 'melon'])}
df=pd.DataFrame(d)
print(df)

            A     B
apple   100.0   111
melon     NaN  4444
orange  300.0   333
pear    200.0   222

In [24]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [27]:
df.index #lista os indexes

Index(['apple', 'melon', 'orange', 'pear'], dtype='object')

In [29]:
df.columns #os nomes das colunas

Index(['A', 'B'], dtype='object')

In [31]:
pd.DataFrame(df,index=['orange','melon','apple'], columns=['A']) #ESPECIFICA QUE LINHAS E COLUNAS 
#QUERO MOSTRAR E TB A ORDEM\

            A
orange  300.0
melon     NaN
apple   100.0

## WE CAN READ DATA FROM A WIDE VARIETY OF DATA SOURCES AS DATAFRAMES

In [32]:
import numpy as np
import pandas as pd

In [47]:
#Read in a very simple CSV file
#file = "C:\\Users\\Administrator\\Desktop\\linearalgebra-mit\\Resp2.csv"
file="C:\\Users\\Administrator\\Desktop\\Data Science\\Keras Tensorflow\\section 2\\Resp2.csv"
df1=pd.read_csv(file) # I didn't have to specify because the separator is a column!
df1.head()

   experience  respiration
0           0         3.94
1           0         4.26
2           0         4.16
3           0         3.76
4           0         4.07

In [48]:
df1.head(7)

   experience  respiration
0           0         3.94
1           0         4.26
2           0         4.16
3           0         3.76
4           0         4.07
5           0         3.57
6           0         4.11

In [49]:
#when your csv is non-standard, not neatly ordered in cols
file="C:\\Users\\Administrator\\Desktop\\Data Science\\Keras Tensorflow\\section 2\\winequality-red.csv"
df1=pd.read_csv(file)
df1.head()

  fixed acidity;"volatile acidity";"citric acid";"residual sugar";"chlorides";"free sulfur dioxide";"total sulfur dioxide";"density";"pH";"sulphates";"alcohol";"quality"
0   7.4;0.7;0;1.9;0.076;11;34;0.9978;3.51;0.56;9.4;5
1   7.8;0.88;0;2.6;0.098;25;67;0.9968;3.2;0.68;9.8;5
2  7.8;0.76;0.04;2.3;0.092;15;54;0.997;3.26;0.65;...
3  11.2;0.28;0.56;1.9;0.075;17;60;0.998;3.16;0.58...
4   7.4;0.7;0;1.9;0.076;11;34;0.9978;3.51;0.56;9.4;5

Does not look very nice!

In [50]:
#when your csv is non-standard, not neatly ordered in cols
file="C:\\Users\\Administrator\\Desktop\\Data Science\\Keras Tensorflow\\section 2\\winequality-red.csv"
df1=pd.read_csv(file, sep=';') #I have to specify the separator when it's not a comma!
df1.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

## We can also read text!

In [51]:
#when your csv is non-standard, not neatly ordered in cols
file="C:\\Users\\Administrator\\Desktop\\Data Science\\Keras Tensorflow\\section 2\\bostonTxt.txt"
df1=pd.read_csv(file, sep="\t")
df1.head()

     MV  INDUS   NOX     RM  TAX    PT  LSTAT
0  24.0   2.31  53.8  6.575  296  15.3   4.98
1  21.6   7.07  46.9  6.421  242  17.8   9.14
2  34.7   7.07  46.9  7.185  242  17.8   4.03
3  33.4   2.18  45.8  6.998  222  18.7   2.94
4  36.2   2.18  45.8  7.147  222  18.7   5.33

## Reading files in excel format!  
We can have more than one sheet in an excel file!

In [9]:
import pandas as pd
file="C:\\Users\\Administrator\\Desktop\\Data Science\\Keras Tensorflow\\section 2\\boston1.xls"
# Load spreadsheet
x1 = pd.ExcelFile(file) #x1 is the variable storing excel file

# Print the sheet names
print(x1.sheet_names)

['Sheet1', 'Sheet2']

In [10]:
import os
os.getcwd() #tells us which working directory we are in

'C:\\Users\\Administrator\\Desktop\\Data Science\\Keras Tensorflow'

In [11]:
# Load a sheet into a DataFrame by name: df1
df1 = x1.parse('Sheet1')

df1.head()

,MV,INDUS,NOX,RM,TAX,PT,LSTAT,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,24.0,2.31,53.8,6.575,296,15.3,4.98,NaN,NaN,Subset of Boston housing tract
1,21.6,7.07,46.9,6.421,242,17.8,9.14,NaN,NaN,data of Harrison and Rubinfeld
2,34.7,7.07,46.9,7.185,242,17.8,4.03,NaN,NaN,(1978). Each case is one U.S.
3,33.4,2.18,45.8,6.998,222,18.7,2.94,NaN,NaN,Census tract in the Boston area.
4,36.2,2.18,45.8,7.147,222,18.7,5.33,NaN,NaN,NaN

In [12]:
df2 = x1.parse('Sheet2')

df2.head()

     MV  INDUS   NOX     RM  TAX    PT  LSTAT
0  24.0   2.31  53.8  6.575  296  15.3   4.98
1  21.6   7.07  46.9  6.421  242  17.8   9.14
2  34.7   7.07  46.9  7.185  242  17.8   4.03
3  33.4   2.18  45.8  6.998  222  18.7   2.94
4  36.2   2.18  45.8  7.147  222  18.7   5.33

## Basic Data Cleaning

In [13]:
import tensorflow as tf
from sklearn.model_selection import train_test_split
from sklearn import metrics
import pandas as pd

In [17]:
file="C:\\Users\\Administrator\\Desktop\\Data Science\\Keras Tensorflow\\section 5\\titanic.csv"
df=pd.read_csv(file)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### I can drop columns if they are not important for me.

In [19]:
train_df=df.drop(['PassengerId','Name','Ticket'],axis=1)
train_df.head()
#see that a couple of columns have been dropped

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Cabin Embarked
0         0       3    male  22.0      1      0   7.2500   NaN        S
1         1       1  female  38.0      1      0  71.2833   C85        C
2         1       3  female  26.0      0      0   7.9250   NaN        S
3         1       1  female  35.0      1      0  53.1000  C123        S
4         0       3    male  35.0      0      0   8.0500   NaN        S

### How many null values per column?

In [21]:
print("Train")
print(train_df.isnull().sum())
#columns age, cabin and embarked have null values

Train
Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Cabin       687
Embarked      2
dtype: int64

### Fill them with mean values

In [23]:
#identify mean ages
male_mean_age=train_df[train_df['Sex']=='male']['Age'].mean()
female_mean_age=train_df[train_df['Sex']=='female']['Age'].mean()
print('female mean age: %1.0f' %female_mean_age)
print('male mean age: %1.0f' %male_mean_age)

female mean age: 28
male mean age: 31

In [27]:
#FILL THE NAN VALUES
train_df.loc[(train_df['Sex']=='male')&(train_df['Age'].isnull()),"Age"]=male_mean_age
train_df.loc[(train_df['Sex']=='female')&(train_df['Age'].isnull()),"Age"]=female_mean_age
#train_df.head()
#same for fare
mean_fare=train_df["Fare"].mean()

In [29]:
#fill na values of cabin and embarked with X and S
train_df['Cabin']=train_df['Cabin'].fillna('X')
train_df['Embarked']=train_df['Embarked'].fillna('S')

In [30]:
train_df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Cabin Embarked
0         0       3    male  22.0      1      0   7.2500     X        S
1         1       1  female  38.0      1      0  71.2833   C85        C
2         1       3  female  26.0      0      0   7.9250     X        S
3         1       1  female  35.0      1      0  53.1000  C123        S
4         0       3    male  35.0      0      0   8.0500     X        S